Merge remote documentation updates
